# Улучшение модели классификации изображений автомобилей

## 1. Анализ выборки


- **Распределение классов:**  
  - Оцените, какие классы представлены в избытке, а какие – в недостатке по полученной метрике после обучения модели
  - Рассмотрите возможность применения методов балансировки (например, oversampling, undersampling или генерация синтетических данных).

- **Предобработка данных:**  
  - Проведите несколько экспериментов с разными пайплайнами аугментаций, оцените дает ли прирост в метрике сложный пайплайн или нет
  - Оцените насколько дает буст использование Weighted Sampler, Loss weights

---

## 2. Анализ ошибок

- **Сбор информации об ошибках:**  
  - Соберите данные о случаях неправильной классификации модели.
  - Постройте confusion matrix (матрицу ошибок) для выявления закономерностей в ошибках.

- **Визуализация ошибок:**  
  - Выделите примеры изображений, где модель ошибается, чтобы визуально оценить проблемные случаи.
  - Сгруппируйте ошибки по типам: например, ошибки между схожими моделями автомобилей или путаница между классами, имеющими общие визуальные признаки.


- **Обратная связь для улучшения:**  
  - Используйте результаты анализа ошибок для корректировки аугментации данных, уточнения классов, выделите данных для finetunning, 
  - Проведите эксперименты с дообучением на проблемных выборках.

---

## 3. Улучшение моделей

- **Улучшение архитектуры:**  
  - Рассмотрите возможность использования современных архитектур (например, EfficientNet, ResNeXt) или их модификаций.
  - Проанализируйте возможность добавления слоев внимания (attention mechanism) для улучшения выделения ключевых признаков.

- **Data Augmentation:**  
  - Применяйте расширенные методы аугментации (вращение, сдвиг, изменение яркости, контрастности) для создания более разнообразного обучающего набора.
  - Добавьте в данные синтетику, данные с других датасетов

- **Методы регуляризации и балансировки:**  
  - Используйте weight decay и другие методы регуляризации для снижения переобучения.
  - Примените техники балансировки классов, такие как focal loss, для корректировки влияния дисбалансированных данных.

---

## 4. План дальнейших шагов

- **Валидация и тестирование:**  
  - Разбейте выборку на обучающую, валидационную и тестовую части для объективной оценки модели, все данные нужно зафиксировать, ( разделить по разным папкам)

- **Документация и отчётность:**  
  - Создавайте отчёты с визуализацией ключевых метрик, чтобы оценивать прогресс и выявлять области для дальнейших улучшений.

---
